/**
 * 폰트의 다양한 포맷 (font1 사진)
 * EOT => TTF/OTF => WOFF => WOFF2 순으로 용량이 작습니다.
 * TTF/OTF: 벡터기반의 폰트형식으로 스캐일이 변해도 품질이 유지되며 모든 운영채제에서 지원함
 * WOFF, WOFF2 : 웹 용으로 개발된 압축 폰트형식임, 빠른 다운로드와 효율적인 웹 성능을 제공함
 * EOT: 웹 용으로 마이크로소프트가 개발한 폰트형식임, 주로 IE6에서 사용됨
 *
 * 따라서 용량이 작은 WOFF,WOFF2를 사용할건데 사진에서 보다시피 WOFF2는 최신기술이라 지원을 안하는 운영체제가 있기에 WOFF2를 사용하면서
 * 지원하지 않는 운영체제는 자동으로 WOFF를 사용하게 끔 만들어 볼거임
 *
 *
 *
 * 폰트 적용하는 방법
 * 1. 웹 폰트 서비스 이용
 * ex) <link href="폰트 서비스" />
 * 2. 폰트 다운로드
 * ex) @font-face {font-family: "폰트이름"; src: url("폰트경로");}
 *
 *
 *
 * 웹 폰트 서비스를 이용하는 방법 (Naver font)
 * 1. https://hangeul.naver.com/font
 * 2. 마음에 드는 폰트를 찾는다
 * 3. 웹 폰트 url을 가져온다.
 * 4. 서비스에 적용해본다
 *
 *
 *
 * 폰트 다운로드 방법
 * 다운 받으면 보통 ttf일 경우가 많은데 우리는 WOFF를 사용할거기 때문에 변환사이트 들어가줘야함
 * https://cloudconvert.com/
 */

/**
 * json-server 데이터 가져오기
 * 1. fetch 함수를 이용하여 json-server의 데이터를 가져온다
 * 2. 로딩 상태를 추가하여 로딩 컴포넌트 노출
 * 3. 에러 상태를 추가하여 에러 컴포넌트 노출
 */
